var myChart = echarts.init(document.getElementById('dashboard'));

// 指定图表的配置项和数据
var option = {
  title: {
    text: '销售仪表盘'
  },
  tooltip: {},
  legend: {
    data:['销售额','销售任务额']
  },
  xAxis: {
    data: ["黄著","刘旺坚","李文科","蔡铭浪","胡斌彬","廖舒婷","胥玉英","邵雪梅","刘俊权","古旭高","段博艳","王萍"]
  },
  yAxis: {},
  series: [{
    name: '销售额',
    type: 'bar',
    data: [3134352.75, 8150670.62, 4677846.24, 4234075.23, 9903786.32, 2657902.04, 5128837.07, 3954075.17, 2290201.87, 6193413.66, 1695026.60, 6736514.25]
  },
  {
    name: '销售任务额',
    type: 'bar',
    data: [3494768.89, 9256901.40, 5017934.03, 4547376.05, 11351234.98, 2975019.23, 4836006.07, 4338816.05, 2384432.89, 6725379.34, 1889511.10, 6153310.88]
  }]
};

// 使用刚指定的配置项和数据显示图表。
myChart.setOption(option);
